[
  {
    "27 Feb 2021, 06:01:16": "So my mom kept a journal her entire life, and let us read some of the entries about how we behaved as toddlers. Apparently I was always a “bear” in the morning; however she stated that I was a very sweet and laid-back kid most of the time. It’s just never been easy for me waking up early. Fast forward to now...my job as a teacher requires me to get up at 5:00 am, and the job is so fun, I MAKE myself do it. The kids at school seem to be struggling with the early hours, too, so I do identify with their struggles. Some of my students have jobs outside of school, and I try to find out which ones work. High school kids today are awesome. I think we will be in good hands in the future."
  },
  {
    "27 Feb 2021, 06:02:05": "*another week later I dodged a bullet \n\nFTFY"
  },
  {
    "27 Feb 2021, 06:16:50": "Then again, being surrounded by assholes is how you get thicc skin"
  },
  {
    "27 Feb 2021, 06:26:08": "You sound tired, so tonight you need a good nights sleep, that is first. \nI have a lot of energy too, so I do have an idea to maybe try. Sounds like you are probably in good shape physically, use that to your advantage to help with mind focus. Have a daily running/workout schedule and stick to it, schedules are super important for the hyper-mind. Next have a goal, to run a marathon or do a triathlon, knowing you have an end goal will give your energy something to focus on, and once you complete it that will help your confidence, it will be something you can put YOURSELF on a pedestal for.\nYou can also schedule to do other things that require mind/body focus and that have an end goal-martial arts, painting classes, dancing. Each accomplishment will help you build your personal pedestal more.\nAs for being needy, some of us are and it can be hard for other people and hurt relationships, that said you cannot “will it away”, be honest about it with people, let them know you are working on it and acknowledge it.\nI hope that helps a little. Maybe just knowing someone read it will help.\nI wish you luck\nDon’t forget to get some sleep"
  },
  {
    "27 Feb 2021, 06:30:37": "A lot of people are just not comfortable with other people’s emotions. They don’t know how to handle it. This doesn’t make you bad or being sensitive bad in ANY way. Being sensitive means you care. Maybe start taking time alone to cry. If you know you are going to cry excuse yourself and spend time alone. Not all the time of course, because there is nothing wrong with crying, but distancing yourself from critics when you do might make you feel better. Also, thank you for caring so much about the world."
  },
  {
    "27 Feb 2021, 06:32:45": "Thank you! I'd say my taste in cartoons is very underappreciated around me lol"
  },
  {
    "27 Feb 2021, 06:33:44": "OP, what helped me most was to focus on the SUBJECT matter. It pivots the attention away from you. Conceptualize facing someone, then riding in a car with them pointing together at something else. That’s it! Also: the redirect and voluntold. Pass the ball and get others involved up front to reduce the burden. Call on peers. Share the feels. This is how I handle DAILY high pressure situations that would have melted me a decade ago. It’s NOT about you!"
  },
  {
    "27 Feb 2021, 06:34:21": "Really appreciate your words bro. Actually I've been working out lots and eating well lol, and I'm starting this program with a personal trainer next week. My goal it's to keep my weight but go under 12% body fat by march 2022. What most annoy me is my social skills. That's why I posted here, cuz things I can control like working or exercise I do pretty good, but when it comes to other people like friends or girls I suck at it and it is what drains my will and energy. \n\nThanks for the advice"
  },
  {
    "27 Feb 2021, 06:35:14": "Haha I could just picture how you straight up said “no thank you” midway their conversation!! You have a good point about bartenders cause it is their job. It can be tough sometimes when they’re swamped on busy nights"
  },
  {
    "27 Feb 2021, 06:40:32": "I really enjoy watching TV shows (Peaky blinders, the crown, Anne with an e, a lot of documentaries, etc) especially during quarantine, but cartoons are just different in a better way. I'm not a big fan of shows like Grey's Anatomy or whatever is popular right now, but I just like cartoons because if I could draw and if I could write good stories, it would look like steven universe or bee and puppycat. Plus, they're cute!! and have cute songs."
  },
  {
    "27 Feb 2021, 06:42:22": "Smh also so many cartoons are aimed at both younger and older audiences (SU, Gumball, Animaniacs, IZ, etc.), and the ones that are aimed at only kids are like wholesome and what's wrong with enjoying that? And there are many that are only aimed at adult audiences (Bojack, Bob's Burgers, Futurama, Disenchantment, American Dad, just to name a few). A ton of people love cartoons, it's so silly to make a blanket statement like that's immature."
  },
  {
    "27 Feb 2021, 06:43:50": "Omg we have the same thing going on and I’m asking myself the same thing. I feel like an alien sometimes 👽"
  },
  {
    "27 Feb 2021, 06:44:43": "Strip club"
  },
  {
    "27 Feb 2021, 06:45:40": "You can't get to somewhere else unless you know where you are."
  },
  {
    "27 Feb 2021, 06:47:52": "[removed]"
  },
  {
    "27 Feb 2021, 06:48:50": "I'm right there with you. I'm sorry people are so unsupportive. You deserve friends who are kind to you and don't judge you and let you feel your feelings."
  },
  {
    "27 Feb 2021, 06:50:15": "Get together with the lads from work every now and then. I used to work in Construction and if it’s the same work environment all around the world there’s always a few characters that love to have a laugh on-site and a beer once they’re off the clock. If you’re close with your colleagues, organise a night out with them."
  },
  {
    "27 Feb 2021, 06:50:31": "There was also a time when I was in Japan and I was riding the train with my partner and I was holding a stuffed animal that I won from a claw machine earlier that day. These two teenage girls started making fun of me in Japanese because they didn't know that my partner fully understood them. That made me feel terrible. Just absolutely terrible and I love claw machines! Maybe I should just stop listening to judgy people!"
  },
  {
    "27 Feb 2021, 06:52:24": "But I'm a man, and I'm yapping more than she is 😆 \n\nHonestly, when she talks about something, I often agree with her, despite knowing very little about what she's talking about. Would it be better to just nod or say \"mhm\" or something? That way I'm not openly agreeing with something I haven't made up my mind on."
  },
  {
    "27 Feb 2021, 06:54:17": "[removed]"
  },
  {
    "27 Feb 2021, 06:59:21": "What's the \"oh snap\" to?"
  },
  {
    "27 Feb 2021, 06:59:30": "You should!!! *looks at my two bookcases full of stuffed toys* Let people enjoy things that arent hurting anyone, like idg why people are like this. You deserve to enjoy these things and those people have their own issues to deal with if they get enjoyment out of disparaging something that brings another person happiness. Emotionally healthy people should be able to find happiness (or at the very least just not be affected at all) from seeing other people get pleasure out of the things they genuinely love. If your idea of a good time is mocking someone like that, seek help."
  },
  {
    "27 Feb 2021, 06:59:32": "Hmmm that’s hard to answer because of course, in my mind they are connected but to an outside observer they may not be. For example, if they talk about birds it would reminds me of my daughter who loves birds. I might then start talking about my daughter. To me there’s a logical connection there but probably not to the outside observer.\n\nBut yeah I would somehow acknowledge their statement, talk about my daughter, then make my way back to talking about birds (the original topic). I do this without thinking and actually only recently noticed this was my pattern in conversation."
  },
  {
    "27 Feb 2021, 07:07:24": "[removed]"
  },
  {
    "27 Feb 2021, 07:08:58": "I've been practicing social skills and I feel the same way. I rather talk more as it helps me practice but some people will find it annoying."
  }
]